from transformers import pipeline
output_dir = "hebert-finetuned-hebrew-squad"
model_checkpoint=output_dir
question_answerer = pipeline("question-answering", model=model_checkpoint)

print("#####################################################################")
context = "ירושלים היא עיר הבירה של מדינת ישראל , והעיר הגדולה ביותר בישראל בגודל האוכלוסייה. נכון לשנת 2021, מתגוררים בה כ-957 אלף תושבים. בירושלים שוכנים מוסדות הממשל של ישראל: הכנסת, בית המשפט העליון, משכן הנשיא, בית ראש הממשלה ורוב משרדי הממשלה. ירושלים שוכנת בהרי יהודה, על קו פרשת המים הארצי של ארץ ישראל, בין הים התיכון וים המלח, ברום של 570 עד 857 מטרים מעל פני הים."
question = "מהי עיר הבירה של מדינת ישראל?"
print("context ",context)
print("question ",question)
ans = question_answerer(question=question, context=context)
print(ans)
print("#####################################################################")

print("#####################################################################")
context = "ירושלים היא עיר הבירה של מדינת ישראל , והעיר הגדולה ביותר בישראל בגודל האוכלוסייה. נכון לשנת 2021, מתגוררים בה כ-957 אלף תושבים. בירושלים שוכנים מוסדות הממשל של ישראל: הכנסת, בית המשפט העליון, משכן הנשיא, בית ראש הממשלה ורוב משרדי הממשלה. ירושלים שוכנת בהרי יהודה, על קו פרשת המים הארצי של ארץ ישראל, בין הים התיכון וים המלח, ברום של 570 עד 857 מטרים מעל פני הים."
question = "היכן שוכנת הכנסת?"
print("context ",context)
print("question ",question)
ans = question_answerer(question=question, context=context)
print(ans)
print("#####################################################################")

print("#####################################################################")
context = "ירושלים היא עיר הבירה של מדינת ישראל , והעיר הגדולה ביותר בישראל בגודל האוכלוסייה. נכון לשנת 2021, מתגוררים בה כ-957 אלף תושבים. בירושלים שוכנים מוסדות הממשל של ישראל: הכנסת, בית המשפט העליון, משכן הנשיא, בית ראש הממשלה ורוב משרדי הממשלה. ירושלים שוכנת בהרי יהודה, על קו פרשת המים הארצי של ארץ ישראל, בין הים התיכון וים המלח, ברום של 570 עד 857 מטרים מעל פני הים."
question = "היכן נמצאת הכנסת?"
print("context ",context)
print("question ",question)
ans = question_answerer(question=question, context=context)
print(ans)
print("#####################################################################")

print("#####################################################################")
context = "כרם הוא מטע שמגדלים בו עצי פרי מסוימים. בדרך כלל מתייחס המושג \"כרם\" למקום גידולן של גפנים, שפירותיהן, הענבים, משמשים למאכל ולייצור יין, אולם גם מטעי זיתים ושקד מצוי מכונים כרמים.הגפן היא שיח מטפס, ולכן בכרמי גפנים מוצבים קרדונים - עמודים שעליהם מדלים את הגפן, וחוטי שילוב (בכרמים מודרניים) התומכים בזמורות הצעירות, נושאות הפירות.בכרמים המגודלים בעל, נטועים כמאה עצים בדונם, ברווחים של כשלושה מטרים אחד מהשני, מודלים בדרך כלל על עמודים בגובה של כשני מטרים, כשעליהם חוטים בצורת סוכה, כך שבין העצים יש שטח פנוי המאפשר עיבוד של הקרקע - בעיקר קילטור החשוב מאוד לניצול יעיל יותר של המים.בכרמים המגודלים בהשקיה מקובל לנטוע 200–300 עצים לדונם, ובמקומות מסוימים באירופה אף 600 עצים. הגפנים נטועות בשורות, גובהן כמטר אחד, וחוטי שילוב עד גובה כ-180 ס\"מ, מחזיקים את הזמורות הצעירות."
question = "מהו כרם?"
print("context ",context)
print("question ",question)
ans = question_answerer(question=question, context=context)
print(ans)
print("#####################################################################")

print("#####################################################################")
context = "הכנרת היא ימה בצפון מזרחה של ישראל. זהו אגם המים המתוקים הגדול בארץ ישראל. בעבר סיפקה הכנרת כרבע מצריכת המים בישראל, אך בעקבות ירידת מפלס המים כתוצאה משנות בצורת שפקדו את ישראל, פחתה שאיבת המים מהאגם ומתקני ההתפלה היו לספק המים העיקרי. כיום מספקת הכנרת בין 2 אחוזים מסך הצריכה ל־13 אחוזים. מפלס מי הכנרת משתנה תכופות על פי עונות השנה ובהתאם לשנים גשומות או שחונות ונמצא לרוב בתחום של 209 עד 212 מטרים מתחת לפני הים. בשנות בצורת נחשפים איים בכנרת עקב ירידת המפלס. הכנרת היא הימה המתוקה הנמוכה ביותר בעולם."
question = "מה גרם לירידת מפלס המים?"
print("context ",context)
print("question ",question)
ans = question_answerer(question=question, context=context)
print(ans)
print("#####################################################################")

print("#####################################################################")
context = "כרמלית היא כלי תחבורה ציבורית תת-קרקעי, היחיד בישראל. הכרמלית מחברת בין שלושה אזורים מרכזיים בעיר חיפה: העיר התחתית, שכונת הדר ומרכז הכרמל. לכרמלית קו בודד ובו שש תחנות פעילות, היא מופעלת על ידי חברת הכרמלית חיפה בעמ. הקמתה של הכרמלית החלה במאי 1956 והסתיימה במרץ 1959. בניגוד לתפיסה הרווחת, לפיה הכרמלית היא רכבת תחתית, אין היא אלא פוניקולר, רכבל הנע על מסילה במקום להיות תלוי באוויר. שלא כמו רכבת, אין בקרונות הכרמלית מנוע, ומשקלם של הקרונות היורדים הוא הכוח העיקרי המניע את הקרונות העולים (מנוע בתחנת הקצה העליונה תורם אף הוא כוח הנעה)."
question = "כמה תחנות יש בכרמלית?"
print("context ",context)
print("question ",question)
ans = question_answerer(question=question, context=context)
print(ans)
print("#####################################################################")


print("#####################################################################")
context = "כרמלית היא כלי תחבורה ציבורית תת-קרקעי, היחיד בישראל. הכרמלית מחברת בין שלושה אזורים מרכזיים בעיר חיפה: העיר התחתית, שכונת הדר ומרכז הכרמל. לכרמלית קו בודד ובו שש תחנות פעילות, היא מופעלת על ידי חברת הכרמלית חיפה בעמ. הקמתה של הכרמלית החלה במאי 1956 והסתיימה במרץ 1959. בניגוד לתפיסה הרווחת, לפיה הכרמלית היא רכבת תחתית, אין היא אלא פוניקולר, רכבל הנע על מסילה במקום להיות תלוי באוויר. שלא כמו רכבת, אין בקרונות הכרמלית מנוע, ומשקלם של הקרונות היורדים הוא הכוח העיקרי המניע את הקרונות העולים (מנוע בתחנת הקצה העליונה תורם אף הוא כוח הנעה)."
question = "מתי הוקמה הכרמלית?"
print("context ",context)
print("question ",question)
ans = question_answerer(question=question, context=context)
print(ans)
print("#####################################################################")

# print("#####################################################################")
# context = ""
# question = ""
# print("context ",context)
# print("question ",question)
# ans = question_answerer(question=question, context=context)
# print(ans)
# print("#####################################################################")


#
# #####################################################################
# context  ירושלים היא עיר הבירה של מדינת ישראל , והעיר הגדולה ביותר בישראל בגודל האוכלוסייה. נכון לשנת 2021, מתגוררים בה כ-957 אלף תושבים. בירושלים שוכנים מוסדות הממשל של ישראל: הכנסת, בית המשפט העליון, משכן הנשיא, בית ראש הממשלה ורוב משרדי הממשלה. ירושלים שוכנת בהרי יהודה, על קו פרשת המים הארצי של ארץ ישראל, בין הים התיכון וים המלח, ברום של 570 עד 857 מטרים מעל פני הים.
# question  מהי עיר הבירה של מדינת ישראל?
# {'score': 0.9999890327453613, 'start': 0, 'end': 7, 'answer': 'ירושלים'}
# #####################################################################
# #####################################################################
# context  ירושלים היא עיר הבירה של מדינת ישראל , והעיר הגדולה ביותר בישראל בגודל האוכלוסייה. נכון לשנת 2021, מתגוררים בה כ-957 אלף תושבים. בירושלים שוכנים מוסדות הממשל של ישראל: הכנסת, בית המשפט העליון, משכן הנשיא, בית ראש הממשלה ורוב משרדי הממשלה. ירושלים שוכנת בהרי יהודה, על קו פרשת המים הארצי של ארץ ישראל, בין הים התיכון וים המלח, ברום של 570 עד 857 מטרים מעל פני הים.
# question  היכן שוכנת הכנסת?
# {'score': 0.9999709129333496, 'start': 253, 'end': 263, 'answer': 'בהרי יהודה'}
# #####################################################################
# #####################################################################
# context  ירושלים היא עיר הבירה של מדינת ישראל , והעיר הגדולה ביותר בישראל בגודל האוכלוסייה. נכון לשנת 2021, מתגוררים בה כ-957 אלף תושבים. בירושלים שוכנים מוסדות הממשל של ישראל: הכנסת, בית המשפט העליון, משכן הנשיא, בית ראש הממשלה ורוב משרדי הממשלה. ירושלים שוכנת בהרי יהודה, על קו פרשת המים הארצי של ארץ ישראל, בין הים התיכון וים המלח, ברום של 570 עד 857 מטרים מעל פני הים.
# question  היכן נמצאת הכנסת?
# {'score': 0.9990867972373962, 'start': 129, 'end': 137, 'answer': 'בירושלים'}
# #####################################################################
# #####################################################################
# context  כרם הוא מטע שמגדלים בו עצי פרי מסוימים. בדרך כלל מתייחס המושג "כרם" למקום גידולן של גפנים, שפירותיהן, הענבים, משמשים למאכל ולייצור יין, אולם גם מטעי זיתים ושקד מצוי מכונים כרמים.הגפן היא שיח מטפס, ולכן בכרמי גפנים מוצבים קרדונים - עמודים שעליהם מדלים את הגפן, וחוטי שילוב (בכרמים מודרניים) התומכים בזמורות הצעירות, נושאות הפירות.בכרמים המגודלים בעל, נטועים כמאה עצים בדונם, ברווחים של כשלושה מטרים אחד מהשני, מודלים בדרך כלל על עמודים בגובה של כשני מטרים, כשעליהם חוטים בצורת סוכה, כך שבין העצים יש שטח פנוי המאפשר עיבוד של הקרקע - בעיקר קילטור החשוב מאוד לניצול יעיל יותר של המים.בכרמים המגודלים בהשקיה מקובל לנטוע 200–300 עצים לדונם, ובמקומות מסוימים באירופה אף 600 עצים. הגפנים נטועות בשורות, גובהן כמטר אחד, וחוטי שילוב עד גובה כ-180 ס"מ, מחזיקים את הזמורות הצעירות.
# question  מהו כרם?
# {'score': 0.17228026688098907, 'start': 8, 'end': 38, 'answer': 'מטע שמגדלים בו עצי פרי מסוימים'}
# #####################################################################
# #####################################################################
# context  הכנרת היא ימה בצפון מזרחה של ישראל. זהו אגם המים המתוקים הגדול בארץ ישראל. בעבר סיפקה הכנרת כרבע מצריכת המים בישראל, אך בעקבות ירידת מפלס המים כתוצאה משנות בצורת שפקדו את ישראל, פחתה שאיבת המים מהאגם ומתקני ההתפלה היו לספק המים העיקרי. כיום מספקת הכנרת בין 2 אחוזים מסך הצריכה ל־13 אחוזים. מפלס מי הכנרת משתנה תכופות על פי עונות השנה ובהתאם לשנים גשומות או שחונות ונמצא לרוב בתחום של 209 עד 212 מטרים מתחת לפני הים. בשנות בצורת נחשפים איים בכנרת עקב ירידת המפלס. הכנרת היא הימה המתוקה הנמוכה ביותר בעולם.
# question  מה גרם לירידת מפלס המים?
# {'score': 0.9999990463256836, 'start': 150, 'end': 161, 'answer': 'משנות בצורת'}
# #####################################################################
# #####################################################################
# context  כרמלית היא כלי תחבורה ציבורית תת-קרקעי, היחיד בישראל. הכרמלית מחברת בין שלושה אזורים מרכזיים בעיר חיפה: העיר התחתית, שכונת הדר ומרכז הכרמל. לכרמלית קו בודד ובו שש תחנות פעילות, היא מופעלת על ידי חברת הכרמלית חיפה בעמ. הקמתה של הכרמלית החלה במאי 1956 והסתיימה במרץ 1959. בניגוד לתפיסה הרווחת, לפיה הכרמלית היא רכבת תחתית, אין היא אלא פוניקולר, רכבל הנע על מסילה במקום להיות תלוי באוויר. שלא כמו רכבת, אין בקרונות הכרמלית מנוע, ומשקלם של הקרונות היורדים הוא הכוח העיקרי המניע את הקרונות העולים (מנוע בתחנת הקצה העליונה תורם אף הוא כוח הנעה).
# question  כמה תחנות יש בכרמלית?
# {'score': 0.9999990463256836, 'start': 160, 'end': 162, 'answer': 'שש'}
# #####################################################################
# #####################################################################
# context  כרמלית היא כלי תחבורה ציבורית תת-קרקעי, היחיד בישראל. הכרמלית מחברת בין שלושה אזורים מרכזיים בעיר חיפה: העיר התחתית, שכונת הדר ומרכז הכרמל. לכרמלית קו בודד ובו שש תחנות פעילות, היא מופעלת על ידי חברת הכרמלית חיפה בעמ. הקמתה של הכרמלית החלה במאי 1956 והסתיימה במרץ 1959. בניגוד לתפיסה הרווחת, לפיה הכרמלית היא רכבת תחתית, אין היא אלא פוניקולר, רכבל הנע על מסילה במקום להיות תלוי באוויר. שלא כמו רכבת, אין בקרונות הכרמלית מנוע, ומשקלם של הקרונות היורדים הוא הכוח העיקרי המניע את הקרונות העולים (מנוע בתחנת הקצה העליונה תורם אף הוא כוח הנעה).
# question  מתי הוקמה הכרמלית?
# {'score': 1.0, 'start': 240, 'end': 249, 'answer': 'במאי 1956'}
# #####################################################################